wikimedia/smash-pig-backup/PaymentProviders/Adyen/Tests/Data/ipn_Authorisation.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <sendNotification xmlns="http://notification.services.adyen.com">
      <notification>
        <live>false</live>
        <notificationItems>
          <NotificationRequestItem>
            <additionalData>
              <entry>
                <key>recurring.recurringDetailReference</key>
                <value>9915692881181044</value>
              </entry>
              <entry>
                <key>recurring.shopperReference</key>
                <value>YOUR_SHOPPER_REFERENCE</value>
              </entry>
            </additionalData>
            <amount>
              <currency xmlns="http://common.services.adyen.com">EUR</currency>
              <value xmlns="http://common.services.adyen.com">1000</value>
            </amount>
            <eventCode>AUTHORISATION</eventCode>
            <eventDate>2021-01-01T01:00:00+01:00</eventDate>
            <merchantAccountCode>YOUR_MERCHANT_ACCOUNT</merchantAccountCode>
            <merchantReference>YOUR_MERCHANT_REFERENCE</merchantReference>
            <operations>
              <string>CANCEL</string>
              <string>CAPTURE</string>
              <string>REFUND</string>
            </operations>
            <paymentMethod>ach</paymentMethod>
            <pspReference>YOUR_PSP_REFERENCE</pspReference>
            <reason>null</reason>
            <success>true</success>
          </NotificationRequestItem>
        </notificationItems>
      </notification>
    </sendNotification>
  </soap:Body>
</soap:Envelope>
